/******************************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:
  ** Author:         曾曼云
  ** Version:        V0.0.1
  ** Date:           2021-9-25
  ** Description:
  ** Others:
  ** Function List:
  ** History:        2021-09 曾曼云 创建
  ** <adc>          <author>    <version >    <desc>
  ** 2021-3-25       sulikang    0.0.1         创建文件
******************************************************************/

#ifndef _cliff_oml_H
#define _cliff_oml_H

/*****************************************************************
* 包含头文件
******************************************************************/
#include "main.h"
#include "devices.h"


/*****************************************************************
* 宏定义
******************************************************************/

/**
 * @ingroup Robot_GPIO_CORE
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
* 宏定义
******************************************************************/

/*****************************************************************
* 结构定义
******************************************************************/



/*****************************************************************
* 全局变量声明
******************************************************************/

/*****************************************************************
* 函数原型声明
******************************************************************/
int32_t cliff_oml_read(const struct ca_device *dev, void *buffer, uint32_t len);
int32_t cliff_oml_write(const struct ca_device *dev, void *buffer, uint32_t len);
int32_t cliff_oml_ioctl(const  struct ca_device *dev,  uint32_t cmd, void *arg);

int32_t cliff_oml_driver_init(struct ca_device *dev);
void cliff_oml_ic_capture_callback(const struct ca_device *dev);
/*****************************************************************
* 函数说明
******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} Robot_I2C_CORE */


#endif
