/******************************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:
  ** Author:         曾曼云
  ** Version:        V0.0.1
  ** Date:           2021-11-01
  ** Description:
  ** Others:
  ** Function List:
  ** History:        2021-09 曾曼云 创建
  ** <time>          <author>    <version >    <desc>
  ** 2021-3-25       sulikang    0.0.1         创建文件
******************************************************************/

#ifndef _CAN_CORE_H
#define _CAN_CORE_H

/*****************************************************************
* 包含头文件
******************************************************************/
#include "main.h"
#include "devices.h"
/*****************************************************************
* 宏定义
******************************************************************/

/**
 * @ingroup Robot_CAN_CORE
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
* 宏定义
******************************************************************/

/*****************************************************************
* 结构定义
******************************************************************/

/*****************************************************************
* 全局变量声明
******************************************************************/

/*****************************************************************
* 函数原型声明
******************************************************************/
typedef  void (*can_rx_callback)(const struct ca_device *dev); 
int32_t can_rxfifo_register_callback(const struct ca_device *dev, can_rx_callback callback);

int32_t can_filter_config(struct ca_bus *bus, uint32_t filter_id, uint32_t filter_ext_id);
int32_t can_read(const struct ca_bus *bus, uint32_t *id, void *buffer, uint32_t len);
int32_t can_write(const struct ca_bus *bus, uint16_t id, void *buffer, uint32_t len);


/*****************************************************************
* 函数说明
******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} Robot_I2C_CORE */


#endif
