/*************************************************
 ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
 ** File name:      common.c
 ** Author:
 ** Version:        V1.0
 ** Date:           2021-01-
 ** Description:
 ** Others:
 ** Function List:
 ** History:        2021-01 robot创建
 ** <time>   <author>    <version >   <desc>
 **
 *************************************************/

/*****************************************************************
 * 包含头文件
 ******************************************************************/
#include "common.h"
#include "main.h"
#include "shell.h"
#include "mem_pool.h"

/**
 * @addtogroup Robot-NAV_407
 * @{
 */

/**
 * @defgroup Robot_COMMON 公共层 - COMMON
 *
 * @brief
 * 是框架中通用的模块集合，该层提供的函数接口，可以由HAL，FAL和PAL共同使用，如日志、延时、定时器、环形缓冲、链表、内存池等模块。
 * \n \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 宏定义
 ******************************************************************/

/*****************************************************************
 * 结构定义
 ******************************************************************/

/*****************************************************************
 * 全局变量定义
 ******************************************************************/

/*****************************************************************
 * 外部变量声明（如果全局变量没有在其它的H文件声明，引用时需在此处声明，
 *如果已在其它H文件声明，则只需包含此H文件即可）
 ******************************************************************/

/*****************************************************************
 * 静态变量定义
 ******************************************************************/

/*****************************************************************
 * 函数原型声明
 ******************************************************************/

/*****************************************************************
 * 函数定义
 *注意，编写函数需首先定义所有的局部变量等，不允许在
 *函数的中间出现新的变量的定义。
 ******************************************************************/

/*****************************************************************/
/**
 * Function:       common_init
 * Description:    初始化COMMON层
 * Calls:
 * Called By:
 * @param[in]
 * @param[out]
 * @return
 *  - -1 表示失败
 *  - 0  表示成功
 *
 * @author:
 * @date
 *
 * @par Modification History
 * @par Author:
 * @par Date:
 * @par Description:
 *
 * @see
 *
 */
/******************************************************************/
int common_init(void) {
		mem_pool_init();
    return 0;
}

/*****************************************************************/
/**
 * Function:       common_deinit
 * Description:    释放COMMON层资源
 * Calls:
 * Called By:
 * @param[in]
 * @param[out]
 * @return
 *  - -1 表示失败
 *  - 0  表示成功
 *
 * @author:
 * @date
 *
 * @par Modification History
 * @par Author:
 * @par Date:
 * @par Description:
 *
 * @see
 *
 */
/******************************************************************/
int common_deInit(void) {
    return 0;
}

SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_FUNC),
                 reboot, HAL_NVIC_SystemReset, sys reboot);

#if 0
__asm int readr0(void)
{
	bx lr
}

__asm int readr1(void)
{
	MOV     R0, R1//所嵌入的汇编代码
	bx lr
}

__asm int readr2(void)
{
	MOV     R0, R2//所嵌入的汇编代码
	bx lr
}

__asm int readlr(void)
{
	MOV     R0, lr//所嵌入的汇编代码
	bx lr
}

__asm int readsp(void)
{
	MOV     R0, sp//所嵌入的汇编代码
	bx lr
}

__asm int readpc(void)
{
	MOV     R0, pc//所嵌入的汇编代码
	bx lr
}

#endif

#ifdef __cplusplus
}
#endif

/* @} Robot_COMMON */
/* @} Robot-NAV_407 */
