/*************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:      mem_pool.h
  ** Author:
  ** Version:
  ** Date:
  ** Description:
  ** Others:
  ** Function List:
  ** History:

  ** <time>   <author>    <version >   <desc>
  **
*************************************************/
#ifndef _MEM_POOL_H_
#define _MEM_POOL_H_


/*****************************************************************
 * 包含头文件(如非特殊需要，H文件不建议包含其它H文件)
 ******************************************************************/

/**
 * @ingroup Robot_MEMPOOL
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 宏定义
 ******************************************************************/
#define MEM_BLOCK_CHECK                       1                  
	
#define MEM_POOL_NAME_LEN                    64                 
	
#define MEM_BLOCK_NUM                       	4         

#define MEM_BLOCK_SIZE_NUM_32                128               /*4K*/
	
#define MEM_BLOCK_SIZE_NUM_64                64               /*4K*/
	
#define MEM_BLOCK_SIZE_NUM_128               32               /*4K*/
	
#define MEM_BLOCK_SIZE_NUM_256               16               /*4K*/


/*****************************************************************
 * 结构定义
 ******************************************************************/

/*****************************************************************
 * 全局变量声明
 ******************************************************************/

/*****************************************************************
 * 函数原型声明
 ******************************************************************/
int mem_pool_init(void);

int  mem_pool_deinit(void);

void* mem_block_alloc(int uiSize);

int mem_block_free(void *ptr);


/*****************************************************************
 * 函数说明
 ******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} Robot_MEMPOOL */

#endif


