/******************************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:
  ** Author:         曾曼云
  ** Version:        V0.0.1
  ** Date:           2021-9-24
  ** Description:
  ** Others:
  ** Function List:
  ** History:        2021-09 曾曼云 创建
  ** <time>          <author>    <version >    <desc>
  ** 2021-3-25       sulikang    0.0.1         创建文件
******************************************************************/

#ifndef _DEFINE_CARPET_H
#define _DEFINE_CARPET_H

/*****************************************************************
* 包含头文件
******************************************************************/
#include "lwrb.h"
#include "cmsis_os2.h"
/*****************************************************************
* 宏定义
******************************************************************/

/**
 * @ingroup Robot_DEVICES
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
* 宏定义
******************************************************************/

/*****************************************************************
* 结构定义
******************************************************************/
typedef enum
{
	  CARPET_SOFT_GROUND,       //软地面
    CARPET_TOUGH_GROUND,      //硬地面
    CARPET_MODULE_ERROR,      //模块失效

	  CARPET_FRAME_MAX          //最多地面类型
} CARPET_GROUND_TYPE_E;       //地面类型

typedef enum
{
    CARPET_SET_CALLBACK,      //注册发布数据的回调函数
    CARPET_GET_GROUND_STATE,  //获取地面类型

    CARPET_MAX_CMD_TYPE,      //最大数据类型
} CARPET_CMD_TYPE_E;          //IOCTL命令类型


/*****************************************************************
* 全局变量声明
******************************************************************/

/*****************************************************************
* 函数原型声明
******************************************************************/
typedef void (*carpet_callback)( uint16_t state ); 

/*****************************************************************
* 函数说明
******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} Robot_DEVICES */


#endif
