/******************************************************************
 ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
 ** File name:
 ** Author:         sulikang
 ** Version:        V0.0.1
 ** Date:           2021-3-25
 ** Description:
 ** Others:
 ** Function List:
 ** History:        2021-03 sulikang 创建
 ** <time>          <author>    <version >    <desc>
 ** 2021-3-25       sulikang    0.0.1         创建文件
 ******************************************************************/

/*****************************************************************
 * 包含头文件
 ******************************************************************/
#include "fal.h"
#include "cmsis_os.h"
//#include "sys_paras.h"
//#include "sys_exc.h"
#include "stdio.h"
#include "shell.h"
//#include "shell_port.h"
#include "delay.h"
#include "cm_backtrace.h"
#include "cmb_def.h"
// #include "wwdg.h"
#include "usart.h"
#include "stdio.h"
#include "rtc.h"
//#include "elog.h"

/***************************/

/**
 * @addtogroup Robot-NAV_407
 * @{
 */

/**
 * @defgroup Robot_PAL 协议适配层 - PAL
 *
 * @brief 
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 私有宏定义
 ******************************************************************/

/*****************************************************************
 * 私有结构体/共用体/枚举定义
 ******************************************************************/

/*****************************************************************
 * 全局变量定义
 ******************************************************************/


/*****************************************************************
 * 私有全局变量定义
 ******************************************************************/

/*****************************************************************
 * 外部变量声明（如果全局变量没有在其它的H文件声明，引用时需在此处声明，
 *如果已在其它H文件声明，则只需包含此H文件即可）
 ******************************************************************/


/*****************************************************************
 * 私有函数原型声明
 ******************************************************************/


/*****************************************************************
 * 函数定义
 ******************************************************************/

/*****************************************************************
 * 函数定义
 *注意，编写函数需首先定义所有的局部变量等，不允许在
 *函数的中间出现新的变量的定义。
 ******************************************************************/


/*****************************************************************/
/**
 * Function:       pal_init
 * Description:    初始化PAL层
 * Calls:
 * Called By:
 * @param[in]
 * @param[out]
 * @return
 *  - -1 表示打开文件失败
 *  - 0  表示打开文件成功
 *
 * @author:
 * @date
 *
 * @par Modification History
 * @par Author:
 * @par Date:
 * @par Description:
 *
 * @see
 *
 */
/******************************************************************/
int pal_init(void) {


    return 0;
}

/*****************************************************************/
/**
 * Function:       pal_deinit
 * Description:    释放PAL层资源
 * Calls:
 * Called By:
 * @param[in]
 * @param[out]
 * @return
 *  - -1 表示打开文件失败
 *  - 0  表示打开文件成功
 *
 * @author:
 * @date
 *
 * @par Modification History
 * @par Author:
 * @par Date:
 * @par Description:
 *
 * @see
 *
 */
/******************************************************************/
int pal_deInit(void) {
    return 0;
}


#ifdef __cplusplus
}
#endif

/* @} Go_PAL */
/* @} Robot-NAV_407 */
